w4d1/first_routes/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
      # artworks = Artwork.all
      # render json: artworks
      user = User.find(params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "The Toilet"], ["id", 3]]
---
    def update
      artwork = Artwork.find(params[:id])

      if artwork.update(artwork_params)