w4d1/first_routes/app/controllers/comments_controller.rb

  def index
    if params.has_key?(:user_id)
      comments = User.find(params[:user_id]).comments
    elsif params.has_key?(:artwork_id)
      comments = Artwork.find(params[:artwork_id]).comments
    else
      comments = Comment.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
SELECT "comments".* FROM "comments"

  def create
    comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("body", "user_id", "artwork_id") VALUES ($1, $2, $3) RETURNING "id"  [["body", "amazing!"], ["user_id", 2], ["artwork_id", 1]]