w4d1/first_routes/app/controllers/users_controller.rb

  def index
    if request.query_string.present?
      users = User.where(request.query_parameters)
    else
      users = User.all
---
SELECT "users".* FROM "users"

  def update
    user = User.find(params[:id])

    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "Ian"], ["id", 4]]