w4d4/MusicApp/app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---
  <select name="albums[band_id]">
    <% Band.all.each do |band| %>