w4d4/MusicApp/app/views/tracks/new.html.erb

SELECT "albums".* FROM "albums"
---
  <select name="tracks[album_id]">
    <% Album.all.each do |album| %>