w4d4/MusicApp/app/controllers/albums_controller.rb

INSERT INTO "albums" ("band_id", "album_type", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 6], ["album_type", "Live"], ["created_at", 2017-04-20 23:23:06 UTC], ["updated_at", 2017-04-20 23:23:06 UTC], ["name", "Second - Live"]]
---
  def create
    @album = Album.new(album_params)
    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "albums" SET "album_type" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["album_type", "Studio"], ["updated_at", 2017-04-21 00:17:42 UTC], ["id", 5]]
---
  def update
    @album = Album.find(params[:id])

    if @album.update(album_params)