w4d4/MusicApp/app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("album_id", "lyrics", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["album_id", 5], ["lyrics", "test"], ["created_at", 2017-04-20 23:36:52 UTC], ["updated_at", 2017-04-20 23:36:52 UTC], ["name", "test"]]
---
  def create
    @track = Track.new(track_params)
    if @track.save